<?php
return [
    "Items" => "Оборудование",
    "Create Items" => "Добавить оборудование",
    "Update Items: {name}" => "Изменение оборудования: {name}",
    "Delete" => "Удалить",
    "View" => "Просмотреть",
    "Update Items" => "Редактирование оборудования",
    "State" => "Состояние",
    "Status Name" => "Состояние",
    "Model" => "Модель",
    "Модель оборудования" => "Модель",
    "Network name item" => "Сетевое имя",
    "Сетевое имя оборудования" => "Сетевое имя",
    "Date of entry" => "Дата внесения записи",
    "Inventory number" => "Инвентарный номер",
    "Serial number" => "Серийный номер",
];