<?php
return [
    'Comment'           => 'Комментарии',
    'Create Moving'     => 'Добавление перемещения',
    'Item ID'           => 'Идентификатор оборудования',
    'Location ID'       => 'Идентификатор места',
    'Moving'            => 'Перемещения',
    'Moving date'       => 'Дата перемещения',
    'Movings'           => 'Перемещения',
    'Status ID'         => 'Идетификатор состояния',
    'Update Moving'     => 'Редактирование перемещения',
    'Update Moving: {name}' => 'Изменение перемещения: {name}',
];