views/locations/_form.php

    <?= $form->field($model,
        'region_id',

        [ 'template' => '<div class="row"><div class="col-md-3">{label}</div><div class="col-md-5">{input}</div><div class="col-md-2">' .
            Html::a( Yii::t('regions', 'Regions'), [ 'regions/index' ], [ 'class' => 'btn btn-primary' ]) .
            '</div><div class="col-md-8">{error}</div></div>', ])
        ->dropDownList(ArrayHelper::merge([ 'empty' => Yii::t('regions', 'Select region') ],
            ArrayHelper::map(Regions::find()->all(),
            'id',
            'name')))->label(Yii::t('regions', 'Region')) ?>
---
SELECT * FROM "regions"