views/locations/index.php

    ]);

    // Название региона
    array_push($columns, [
        'attribute' => 'regionName',
        'filter' => Html::activeDropDownList(
            $searchModel,
            'regionName',
            ArrayHelper::merge([ '' => Yii::t('locations', 'All regions'), ], ArrayHelper::map(Regions::find()->orderBy('name')->all(), 'name', 'name')
            ) ,
            [ 'class' => 'form-control', ],
        ),
        'value' => function ($data)
        {
            return showUrlUpdate($data->regions->name, $data);
        },
        'format' => 'raw',
    ]);
---
SELECT * FROM "regions" ORDER BY "name"