controllers/LocationsController.php

SELECT * FROM "locations" WHERE "id"='14'
---
    protected function findModel($id)
    {
        if (($model = Locations::findOne($id)) !== null)