controllers/RegionsController.php

    protected function findModel($id)
    {
        if (($model = Regions::findOne($id)) !== null)
---
SELECT * FROM "regions" WHERE "id"='4'