controllers/TypesController.php

    protected function findModel($id)
    {
        if (($model = Types::findOne($id)) !== null) {
---
SELECT * FROM "types" WHERE "id"='5'