views/items/_form.php

SELECT * FROM "types" ORDER BY "name"
---
//$this->registerJsFile("@web/js/regiondatepicker.js", ['depends' => [ \yii\web\JqueryAsset::className() ]] );

    // Создание сортированного списка для выбора типов оборудования
    $types = ArrayHelper::map(Types::find()->orderBy('name')->all(), 'id', 'name');

SELECT * FROM "status" ORDER BY "name"
---
    if ($model->isNewRecord)
    {
        // Создание сортированного списка для выбора состояний оборудования
        $states = ArrayHelper::map(Status::find()->orderBy('name')->all(), 'id', 'name');