views/items/index.php

    ] ); // */

    // Состояние
    array_push($columns, [ 'attribute' => 'statusName',
        'filter' => Html::activeDropDownList(
            $searchModel,
            'statusName',
            ArrayHelper::merge(
                [ '' => Yii::t('app', 'All statuses'), ],
                ArrayHelper::map(Status::find()->orderBy('name')->all(), 'name', 'name')
            ),
            [ 'class' => 'form-control', ],
        ) ,
        'value' => function ($data)
        {
            return showUrlUpdate($data->statusName, $data);
        },
        'format' => 'raw',
    ] ); // */
---
SELECT * FROM "status" ORDER BY "name"